// Напишите код, который посчитает сумму всех парных элементов в массиве. В суммировании участвуют только элементы больше 3.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const array = [1, 2, 3, 4, 5, 6];

////////////////// Решение //////////////////

const array = [1, 2, 3, 4, 5, 6];
var CurNum;
var summa  = 0;

for (CurNum of array) {
    if ((CurNum % 2 === 0) && (CurNum > 3)) {
        summa = summa + CurNum;
    }
}
console.log(summa);

///////////////////////////////////////////////