// С помощью цикла `for` и оператора `if` выведите на экран столбец элементов, которые больше 3-х, но меньше 10.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const array = [2, 5, 9, 15, 0, 4];

////////////////// Решение //////////////////

const array = [2, 5, 9, 15, 0, 4];
let currentNumber;

for (currentNumber of array) {
    if ((currentNumber > 3) && (currentNumber < 10)) {
        console.log(currentNumber);
    }
}

///////////////////////////////////////////
