// С помощью цикла `for` и оператора `if` выведите на экран столбец элементов, которые больше 3-х, но меньше 10.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const array = [2, 5, 9, 15, 0, 4];

////////////////// Решение //////////////////

const array = [2, 5, 9, 15, 0, 4];
var CurrentNumber;

for (CurrentNumber of array) {
    if ((CurrentNumber > 3) && (CurrentNumber < 10)) {
        console.log(CurrentNumber);
    }
}

///////////////////////////////////////////
