// У вас есть массив с элементами в виде положительных чисел.
// Найдите сумму таких элементов массива.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const array = [2, -1, -3, 15, 0, 4];

////////////////// Решение //////////////////

const array = [2, -1, -3, 15, 0, 4];
let sum  = 0;
let currentElement;

for(currentElement of  array) {
    if(currentElement > 0) {
        sum = sum + currentElement;
    }
}
console.log(sum);

//////////////////////////////////////////////