// У вас есть массив с элементами в виде положительных чисел.
// Найдите сумму таких элементов массива.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const array = [2, -1, -3, 15, 0, 4];

////////////////// Решение //////////////////

const array = [2, -1, -3, 15, 0, 4];
var sum  = 0;
var CurrentElement;

for(CurrentElement of  array) {
    if(CurrentElement > 0) {
        sum = sum + CurrentElement;
    }
}
console.log(sum);

//////////////////////////////////////////////