// Напишите код, который посчитает сумму всех парных элементов в массиве. В суммировании участвуют только элементы больше 3.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const array = [1, 2, 3, 4, 5, 6];

////////////////// Решение //////////////////

const array = [1, 2, 3, 4, 5, 6];
let curNum;
let summa = 0;

for (curNum of array) {
    if ((curNum % 2 === 0) && (curNum > 3)) {
        summa = summa + curNum;
    }
}
console.log(summa);

///////////////////////////////////////////////