// Отсортируйте массив по убыванию.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const arr = [1, 2, 3, 4, 5, 6];
// [6,5,4,3,2,1]

////////////////// Решение //////////////////

const array = [1, 2, 3, 4, 5, 6];
let i, j, k;

for (i = 0; i < 5; ++i) {
    for (j = 0; j < 5; ++j) {
        if (array[j] < array[j + 1] ) {
            k = array[j];
            array[j] = array[j + 1];
            array[j + 1] = k;
        }
    }
}
for (i = 0; i < 5; ++i) {
    j = i;
    console.log('Element', ++j, ' of new array = ',array[i]);
}
////////////////////////////////////////////